bluemelony12/STM32_AI_HandPosture_LED/Core/Inc/app_utils.h
/**
 ******************************************************************************
 * @file    app_utils.h
 * @author  MCD Application Team
 * @brief   Library to manage application related operation
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2023 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */

#ifndef INC_APP_UTILS_H_
#define INC_APP_UTILS_H_

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"
#include "vl53lmz_api.h"
#include "network.h"

#include <stdbool.h>

/* Exported macro ------------------------------------------------------------*/

/* Network-related macro ---------*/
/* Maximum number of zones */
#define SENSOR__MAX_NB_OF_ZONES                   (64)
/* Max distance software limit */
#define HANDPOSTURE_APP_MAX_DISTANCE_MM           (400)
/* Used if the zone is not valid */
#define DEFAULT_RANGING_VALUE                     (4000)
/* Used if the zone is not valid */
#define DEFAULT_SIGNAL_VALUE                      (0)
/* Median */
#define NORMALIZATION_RANGING_CENTER              (295)
/* Interquartile range */
#define NORMALIZATION_RANGING_IQR                 (196)
/* Median */
#define NORMALIZATION_SIGNAL_CENTER               (281)
/* Interquartile range */
#define NORMALIZATION_SIGNAL_IQR                  (452)
/* Number of output class filtering */
#define LABEL_FILTER_N                            (3)
/* Keep last class valid until a new one is detected */
#define KEEP_LAST_VALID                           (1)
/* Conversion from 14.2 fixed point values to floating point */
#define FIXED_POINT_14_2_TO_FLOAT                 (4.0)
/* Conversion from 21.11 fixed point values to floating point */
#define FIXED_POINT_21_11_TO_FLOAT                (2048.0)

/* Communication-related macro ---*/
/* UART buffer size */
#define UART_BUFFER_SIZE                          (2048)

/* Sensor-related macro ----------*/
#define XTALK_MARGIN                              (50)
#define MILLIHERTZ_TO_HERTZ                       (1000)
#define RESOLUTION_16                             (16)
/* To select strongest (default) or closest target first */
#define DEV_PSORT_CFG_IDX                         ((uint16_t) 0xae64)

#define MAX_COMMAND_BUFFER_SIZE 776

/* Exported types ------------------------------------------------------------*/
struct pipe_grp__sort__cfg_t
{
  uint8_t sort__target_order;
  uint8_t sort__cfg__pad_0;
  uint8_t sort__cfg__pad_1;
  uint8_t sort__cfg__pad_2;
};

/** @struct dci_grp__dss_cfg_t
*   @brief DSS Configuration Parameters
*   @{
*/
struct dci_grp__dss_cfg_t {
  /**
   * - max_value = 4095
   * - min_value = 0
   * - format = unsigned 12.4
   * - units = Mcps
   * - resolution = 0.0625
  */
  uint16_t dss__lower_target_rate_mcps;
  /**
   * - max_value = 4095
   * - min_value = 0
   * - format = unsigned 12.4
   * - units = Mcps
   * - resolution = 0.0625
  */
  uint16_t dss__upper_target_rate_mcps;
  /**
   * - max_value = 4095
   * - min_value = 0
   * - format = unsigned 12.4
   * - units = effective SPAD's
   * - resolution = 0.0625
  */
  uint16_t dss__initial_effective_spads;
  /**
   * - max_value = 4095
   * - min_value = 0
   * - format = unsigned 12.4
   * - units = effective SPAD's
   * - resolution = 0.0625
  */
  uint16_t dss__min_effective_spads;
  /**
   * - max_value = 4095
   * - min_value = 0
   * - format = unsigned 12.4
   * - units = effective SPAD's
   * - resolution = 0.0625
  */
  uint16_t dss__max_effective_spads;
  /**
   * - max_value = 2
   * - min_value = 0
   * - format = unsigned 2.0
  */
  uint8_t dss__additional_steps;
  uint8_t dss__mode;
  /**
   * - max_value = 1
   * - min_value = 0
   * - format = unsigned 1.7
   * - resolution = 0.0078
  */
  uint8_t dss__spatial_mode;
  uint8_t dss_cfg__spare_0;
  uint8_t dss_cfg__spare_1;
  uint8_t dss_cfg__spare_2;
};


union dci_union__block_header_u {
  uint32_t bytes;
  struct {

    uint32_t p_type : 4;

    uint32_t b_size__p_rep : 12;

    uint32_t b_idx__p_idx : 16;
  };
};

struct dci_grp__rng_repeat_cfg_t {
  uint16_t rng_repeat__ranging_rate_hz;
  uint16_t rng_repeat__fw_per_range_overhead_us;
};

struct fw_grp__analogue_dynamic_t {
  uint16_t pll_fm_depth;
  uint16_t pll_fm_freq;
  uint8_t vcsel_sel_ctrl_0;
  uint8_t vcsel_sel_ctrl_1;
  uint8_t vcsel_mon_ctrl;
  uint8_t vcselcp_sel_ovrcur_ctrl;
  uint8_t vcselcp_clk_range_sel;
  uint8_t sequencer_output_delay;
  uint8_t vcselcp_bootup_fsm_ext_en;
  uint8_t vcsel_atest1_sel;
  uint8_t vcselcp_mini_sel;
  uint8_t vcselcp_reg_sel;
  uint8_t analogue_dynamic_pad_0;
  uint8_t analogue_dynamic_pad_1;
};

struct Params_t {
	int gesture_gui;				// Enable a specific data logging on the Uart for the GUI
	uint32_t Resolution;			// Sensor resolution, only 64 is available
	int RangingPeriod;				// Ranging period in ms
	int IntegrationTime;			// Integration time in ms
	int SensorOrientation;			// See User Manual
	int ranging_ignore_dmax_mm; 	// Any range above this value is not considered by the gesture library
	//Level Control algo tuning parameters
	float lc_stable_threshold;		// Speed Threshold to detect a stable hand
	long lc_stable_time_threshold;	// Duration to detect a stable hand
	int lc_maxDistance_mm;			// Distance associated to 100% Level Control
	int lc_minDistance_mm;			// Distance associated to 0% Level Control
	//Gesture Algo tuning params
	int gesture_selection;			// Only 0 supported : Horizontal SWIPES(Right/Left) + TAP  + Double TAP // More gesture coming soon
	long double_tap_ts_threshold;	// Max duration 2 TAPs (msec)
	int screening_ms;       		// Duration needed with no other prediction to lock current
    int analysis_ms;        		// Time window to compute speed in ms
	int dead_ms;            		// Duration which no new gesture can be predicted
	int closer_mm;					// Min distance difference to declare a new motion as "closer"
	int min_speed_x_mm_s;			// Vx speed Threshold (mm/s)
	int min_speed_y_mm_s;			// Vy speed Threshold (mm/s)
	int min_speed_z_mm_s;			// Vz speed Threshold (mm/s)
	int max_speed_mm_s;				// Max Speed for a valid motion
	float min_vx_vy;				// Threshold Ratio VX vs VY
	float min_vx_vz;				// Threshold Ratio VX vs VZ
	float min_vy_vx;				// Threshold Ratio VY vs VX
	float min_vy_vz;				// Threshold Ratio VY vs VZ
	float min_vz_vx;				// Threshold Ratio VZ vs VX
	float min_vz_vy;				// Threshold Ratio VZ vs VY
	//User Filtering
	int min_user_filtering_mm;		// min distance to locate the user
	int max_user_filtering_mm;		// max distance to locate the user
	int filtering_area_mm;			// area ahead the user where gestures will be filtered
};

typedef struct {
  int start;
  int stop;
  int get_caldata;
  uint8_t buffer[MAX_COMMAND_BUFFER_SIZE];
  int calibrate;
} CommandData_t;

typedef struct {
  long timestamp_ms;
  uint8_t target_status[SENSOR__MAX_NB_OF_ZONES];
  uint8_t nb_targets[SENSOR__MAX_NB_OF_ZONES];
  float ranging[SENSOR__MAX_NB_OF_ZONES];
  float peak[SENSOR__MAX_NB_OF_ZONES]; /* Distance [mm] */
} HANDPOSTURE_Input_Data_t;

typedef struct {
  /* Internals */
  uint8_t is_valid_frame;
  uint8_t previous_label;
  uint8_t label_count;
  /* Outputs */
  uint8_t model_output;
  uint8_t handposture_label;
} HANDPOSTURE_Data_t;

typedef struct
{
  /* App context */
  bool app_run;
  struct Params_t Params;

  /* Sensor context */
  VL53LMZ_Configuration ToFDev;
  VL53LMZ_Platform p_platform;
  VL53LMZ_ResultsData RangingData;
  volatile int IntrCount;
  bool new_data_received;
  bool params_modif;

  /* NN context */
  HANDPOSTURE_Input_Data_t HANDPOSTURE_Input_Data;
  HANDPOSTURE_Data_t AI_Data;
  float aiInData[AI_NETWORK_IN_1_SIZE];
  float aiOutData[AI_NETWORK_OUT_1_SIZE];

  /* Comm context */
  volatile char Uart_RXBuffer[UART_BUFFER_SIZE];
  char Comm_RXBuffer[UART_BUFFER_SIZE];
  volatile size_t Uart_RxRcvIndex;
  volatile uint32_t Uart_nOverrun;
  volatile uint8_t UartComm_CmdReady;
  uint32_t frame_count;
} AppConfig_TypeDef;

#endif /* INC_APP_UTILS_H_ */
